---
kind: type
id: T:Autodesk.Revit.DB.Surface
source: html/bb391358-5ca0-578d-e8e2-6d1b30c472d8.htm
---
# Autodesk.Revit.DB.Surface

A mathematical representation of a surface.

## Syntax (C#)
```csharp
public class Surface : IDisposable
```

## Remarks
This geometric object is not bounded by edges or edge loops. A bounded surface obtained from a Revit element
 will be represented by a Face instead.